<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	<h1>Функции</h1>
	<h2>Пользовательские функции</h2>
	<hr>
	<h2>Топ 5 кассовых фильмов Голливуда</h2>

	<ol>
		<li>Зеленая миля: 
			<ul>
				<li>режиссёр: Фрэнк Дарабонт</li>
				<li>год: 1999</li>
				<li>страна: США</li>
			</ul>
		</li>
		<li>Криминальное чтиво:
			<ul>
				<li>режиссёр: Квентин Тарантино</li>
				<li>год: 1994</li>
				<li>страна: США</li>
			</ul>
			</li>
		<li>Форрест Гамп: 
			<ul>
				<li>режиссёр: Роберт Земекис</li>
				<li>год: 1994</li>
				<li>страна: США</li>
			</ul>
		</li>
		<li>Бойцовский клуб: 
			<ul>
				<li>режиссёр: Дэвид Финчер</li>
				<li>год: 1999</li>
				<li>страна: США, Германия</li>
			</ul>
		</li>
		<li>Побег из Шоушенка: 
			<ul>
				<li>режиссёр: Фрэнк Дарабонт</li>
				<li>год: 1994</li>
				<li>страна: США</li>
			</ul>
		</li>
	</ol>

	<?php

		// прекратим выполнение скрипта
		return;
	?>

	<h1>Цитаты русских писателей</h1>
	
	<div id="citate">
		<p>Замечательный день сегодня. То ли чай пойти выпить, то ли повеситься (А.Чехов).

		<p>А она — подошла к столу и выпила, залпом, ещё сто пятьдесят, ибо она была совершенна, а совершенству нет предела (В.Ерофеев).
		
		<p>Хорошо идти, когда зовут. Ужасно — когда не зовут. Однако лучше всего, когда зовут, а ты не идёшь (С.Довлатов).
	</div>	


</body>
</html>