<?php
	// масссив библиотека
	$biblio = [
		[
		"id" => 1,
		"author" => "Чехов А.П.",
		"books" => ["Дядя Ваня", "Три сестры", "Вишнёвый сад"] 	
		 ],
		[
		"id" => 2,
		"author" => "Довлатов С.Д.",
		"books" => ["Заповедник", "Компромисс", "Марш одиноких", "Соло на ундервуде"] 	
		],
		[
		"id" => 3,
		"author" => "Булгаков М.А.",
		"books" => ["Белая гвардия", "Ханский огонь"] 	
		],
		[
		"id" => 4,
		"author" => "Севела Э.Е.",
		"books" => ["Легенды Инвалидной улицы"] 	
		]		
	];

	echo "<pre>";
	print_r($biblio);