<?php
	// определяем массив
	$team = array (
		'name' => "The Rolling Stones", 
		'alias' => "the-rolling-stones", 
		'country' => "Великобритания", 
		'content' => "The Rolling Stones  — британская рок-группа, образовавшаяся 12 июля 1962 года и многие годы соперничавшая по популярности с The Beatles. The Rolling Stones, ставшие важной частью Британского вторжения, считаются одной из самых влиятельных и успешных групп в истории рока… Музыкальный стиль The Rolling Stones, формировавшийся под влиянием Роберта Джонсона, Бадди Холли, Элвиса Пресли, Чака Берри, Бо Диддли и Мадди Уотерса, с течением времени обретал индивидуальные черты; авторский дуэт Джаггер-Ричардс получил в конечном итоге всемирное признание."
	);

	// ....
	
?>

<!doctype html>
<html lang="ru">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	
	<h1>Безопасность данных</h1>

	<a href='form.php'>Редактировать данные</a>


</body>
</html>