<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	<h1>Основы программирования</h1>
	<h2>Введение в PHP</h2>

	<?php
		// print без скобок
		print "Hello, User!<br />";
		// print со скобками
		print("Изучаем PHP с omsk_proger<br>")
	?> 

	<!-- 
	это уже html-комментарий, им я хотел сказать, что
	количество вставок php-тегов не ограничено
	-->
	
	<?php
		// можно использовать echo с несколькими параметрами
		// хотя применяется такой вывод не часто
		echo "Можно ", "выводить ", " и так…!";
	?>
	

</body>
</html>