<?php
	// определяем индексный двумерный массив
	$team = 
	[
		array (
		"The Rolling Stones", 
		"the-rolling-stones", 
		"Великобритания", 
		"The Rolling Stones  — британская рок-группа, образовавшаяся 12 июля 1962 года и многие годы соперничавшая по популярности с The Beatles. The Rolling Stones, ставшие важной частью Британского вторжения, считаются одной из самых влиятельных и успешных групп в истории рока…"
		),
		array (
		"AC/DC", 
		"ac-dc", 
		"Австралия", 
		"Австралийская рок-группа, сформированная в Сиднее в ноябре 1973 года выходцами из Шотландии, братьями Малькольмом и Ангусом Янгами. AC/DC часто рассматриваются как пионеры хард-рока и хеви-метала."
		)
	];

	// ... 

?>

<!doctype html>
<html lang="ru">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	
	<h1>Безопасность данных</h1>
	
	<a href='target.php'>Вывести данные</a>


</body>
</html>